{
  "name": "Dominic Varghese",
  "label": "PhD Candidate in Materials Science",
  "image_path": "img/Dominic_Varghese.jpeg",
  "contact": {
    "email": "vargh085@umn.edu",
    "phone": "+1-9522459931",
    "location": "Minneapolis, MN"
  },
  "summary": "PhD candidate in Materials Science with a proven track record of leveraging machine learning and first-principles calculations to solve complex materials engineering problems. Seeking to apply expertise in developing predictive models and computational simulations to drive new technology development in a corporate R&D environment.",
  "base_url": "127.0.0.1:5500",
  "social_links": [
    {
      "label": "LinkedIn",
      "url": "https://linkedin.com/in/dominic-varghese-408682219/",
      "svg_path": "img/globe.svg"
    },
    {
      "label": "Website",
      "url": "https://dominicvarghese.github.io/",
      "svg_path": "img/linkedin.svg"
    }
  ],
  "work_experience": [
    {
      "company": "CEMS, University of Minnesota",
      "position": "Graduate Research Assistant",
      "url": "https://birol.cems.umn.edu/",
      "start_date": "12/2023",
      "end_date": "Present",
      "summary": "Research on the flexoelectric effect in binary metal oxides under the guidance of Prof. Turan Birol.",
      "highlights": [
        "Discovered that epitaxial strain significantly enhances the flexoelectric coefficient in alkaline-earth-metal oxides by lowering optical phonon mode frequencies.",
        "Quantified the relationship between strain and flexoelectric tensor components using first-principles calculations (ABINIT), Landau theory, and Group theory.",
        "Fine-tuning foundational Machine Learning Interatomic Potentials (MLIPs) to enable accurate and efficient modeling of flexoelectricity in larger, more complex crystal structures."
      ]
    },
    {
      "company": "SSCU, Indian Institute of Science",
      "position": "Undergraduate Researcher",
      "url": "https://sites.google.com/site/awadheshnarayan00/Home",
      "start_date": "08/2022",
      "end_date": "06/2023",
      "summary": "Research on the non-linear Hall effect in Ferroelectrics under the guidance of Prof. Awadhesh Narayan.",
      "highlights": [
        "Identified optimal doping concentrations in ferroelectric perovskites that maximize the Berry Curvature Dipole (BCD), leading to an enhancement of the Non-Linear Hall effect.",
        "Systematically varied doping concentrations and computed BCD using Quantum Espresso and Wannier90, successfully demonstrating a tunable electronic response."
      ]
    }
  ],
  "projects": [
    {
      "title": "Fraud Detection in Financial Transactions Using Machine Learning",
      "summary": "Course project focusing on applying various machine learning classifiers to a large, imbalanced financial dataset to detect fraudulent transactions.",
      "url": "",
      "highlights": [
        "Engineered and evaluated multiple classifiers (K-Means Clustering, SVM, Naive Bayes) to detect fraud within a highly imbalanced dataset of 1 million transactions.",
        "Optimized a SVM with an RBF kernel, achieving a robust AUC of 0.93 and capturing 69% of fraudulent cases at a practical 5% False Positive Rate.",
        "Developed a K-Means clustering pipeline using Random Under-Sampling and PCA to overcome class imbalance, boosting model performance to a peak F1-score of 0.80."
      ],
      "images": []
    },
    {
      "title": "Piezoelectric Modulus Prediction Using Machine Learning",
      "summary": "Developed a complete machine learning pipeline to classify and predict the piezoelectric modulus for a large set of inorganic materials from the JARVIS database.",
      "url": "",
      "highlights": [
        "Constructed a dual classification and regression pipeline to predict the piezoelectric modulus for 1,354 unique inorganic materials.",
        "Achieved 78% accuracy with an XGBoost classifier to identify piezoelectric materials, utilizing SHAP analysis to discover that crystal symmetry was a critical predictive feature.",
        "Engineered a LightGBM regression model that accurately predicted piezoelectric constants, achieving a final Root Mean Squared Error of 0.49 by integrating a pre-trained model for band gap prediction."
      ],
      "images": []
    },
    {
        "title": "Predicting Band Gap in Inorganic Materials Using Machine Learning",
        "summary": "Course project exploring various machine learning algorithms to predict band gaps and classify materials as conductors or insulators.",
        "url": "",
        "highlights": [
          "Explored multiple ML algorithms - regression, SVM, decision trees and neural networks - to create a predictive framework for inorganic material band gaps.",
          "Developed a classification pipeline that successfully categorized materials as conductors or insulators, identifying XGBoost as the most accurate and efficient model for the task.",
          "Demonstrated that Artificial Neural Networks outperformed all other tested models for the regression task, establishing them as the superior method for predicting precise band gap values."
        ],
        "images": []
    }
  ],
  "volunteer_experience": [],
  "education": [
    {
      "institution": "University of Minnesota",
      "location": "Twin-Cities, US",
      "url": "",
      "degrees": [
        "Doctor of Philosophy - Materials Science"
      ],
      "honors": [],
      "gpa_cumulative": "3.8",
      "gpa_major": "",
      "graduation_date": "2028"
    },
    {
      "institution": "Indian Institute of Science",
      "location": "Bengaluru, India",
      "url": "",
      "degrees": [
        "Master of Science - Chemistry"
      ],
      "honors": [],
      "gpa_cumulative": "8.8",
      "gpa_major": "",
      "graduation_date": "07/2023"
    },
    {
        "institution": "Indian Institute of Science",
        "location": "Bengaluru, India",
        "url": "",
        "degrees": [
          "Bachelor of Science Research - Chemistry (Major) and Materials (Minor)"
        ],
        "honors": [],
        "gpa_cumulative": "8.6",
        "gpa_major": "",
        "graduation_date": "07/2022"
      }
  ],
  "skills": [
    { "name": "First-principles calculations (DFT, DFPT)", "proficiency": 95, "proficiency_label": "Expert" },
    { "name": "High Performance Computing", "proficiency": 85, "proficiency_label": "Advanced" }
    { "name": "Python", "proficiency": 95, "proficiency_label": "Advanced" },
  ],
  "interests": [],
  "languages": [
    { "language": "English", "fluency": "Full Professional Proficiency" }
  ],
  "references": []
}
